#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/chriswilding/terraform-github/runs/run-S6Hcxb9tqGAjMeGp

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...
github_repository.mazes_for_programmers: Refreshing state... [id=mazes-for-programmers]
github_repository.tiger_go: Refreshing state... [id=tiger-go]
github_repository.curriculum_vitae: Refreshing state... [id=curriculum-vitae]
github_repository.tiger_ocaml: Refreshing state... [id=tiger-ocaml]
github_repository.canvas: Refreshing state... [id=canvas]
github_repository.exercism_c: Refreshing state... [id=exercism-c]
github_repository.organisation_accounts_client: Refreshing state... [id=organisation-accounts-client]
github_repository.sahi: Refreshing state... [id=sahi]
github_repository.exercism_x86_64_assembly: Refreshing state... [id=exercism-x86-64-assembly]
github_repository.ginventory: Refreshing state... [id=ginventory]
github_repository.magidash: Refreshing state... [id=magidash]
github_repository.go_base: Refreshing state... [id=go-base]
github_repository.terraform_aws_secrets: Refreshing state... [id=terraform-aws-secrets]
github_repository.exercism_ocaml: Refreshing state... [id=exercism-ocaml]
github_repository.www_chriswilding_dev: Refreshing state... [id=www.chriswilding.dev]
github_repository.powerful_command_line_applications_in_go: Refreshing state... [id=powerful-command-line-applications-in-go]
github_repository.merchants_guide_to_the_galaxy: Refreshing state... [id=merchants-guide-to-the-galaxy]
github_repository.to_roman_numeral: Refreshing state... [id=to-roman-numeral]
github_repository.advent_of_code_2018: Refreshing state... [id=advent-of-code-2018]
github_repository.exercism_kotlin: Refreshing state... [id=exercism-kotlin]
github_repository.jinventory: Refreshing state... [id=jinventory]
github_repository.bill: Refreshing state... [id=bill]
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_repository.exercism_go: Refreshing state... [id=exercism-go]
github_repository.exercism_erlang: Refreshing state... [id=exercism-erlang]
github_repository.experiment_aurora_lambda: Refreshing state... [id=experiment-aurora-lambda]
github_repository.terraform_github: Refreshing state... [id=terraform-github]
github_repository.aws_nuke: Refreshing state... [id=aws-nuke]
github_repository.experiment_kafka: Refreshing state... [id=experiment-kafka]
github_repository.nasa: Refreshing state... [id=nasa]
github_repository.exercism_java: Refreshing state... [id=exercism-java]
github_repository.advent_of_code_2021: Refreshing state... [id=advent-of-code-2021]
github_repository.advent_of_code_2019: Refreshing state... [id=advent-of-code-2019]
github_repository.experiment_autotag: Refreshing state... [id=experiment-autotag]
github_repository.discography_api: Refreshing state... [id=discography-api]
github_repository.advent_of_code_2017: Refreshing state... [id=advent-of-code-2017]
github_repository.experiment_io_ts: Refreshing state... [id=experiment-io-ts]
github_repository.pact_broker_secrets: Refreshing state... [id=pact-broker-secrets]
github_repository.fsa: Refreshing state... [id=fsa]
github_repository.exercism_rust: Refreshing state... [id=exercism-rust]
github_repository.bookshelf_api: Refreshing state... [id=bookshelf-api]
github_repository.advent_of_code_2020: Refreshing state... [id=advent-of-code-2020]
github_repository.hotels: Refreshing state... [id=hotels]
github_repository.crawl: Refreshing state... [id=crawl]
github_repository.nand2tetris: Refreshing state... [id=nand2tetris]
github_repository.spring_microservices_in_action: Refreshing state... [id=spring-microservices-in-action]
github_repository.proglog: Refreshing state... [id=proglog]
github_repository.pact_broker: Refreshing state... [id=pact-broker]
github_repository.exercism_typescript: Refreshing state... [id=exercism-typescript]
github_repository.clox: Refreshing state... [id=clox]
github_repository.exercism_elixir: Refreshing state... [id=exercism-elixir]
github_repository.jlox: Refreshing state... [id=jlox]
github_repository.exercism_mips: Refreshing state... [id=exercism-mips]
github_repository.bump: Refreshing state... [id=bump]
github_repository.monkey: Refreshing state... [id=monkey]
github_repository.exercism_scala: Refreshing state... [id=exercism-scala]
github_repository.terraform_aws: Refreshing state... [id=terraform-aws]
github_repository.programming_rust: Refreshing state... [id=programming-rust]
github_branch_protection.mazes_for_programmers: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE2NjcxMzE=]
github_branch_protection.organisation_accounts_client: Refreshing state... [id=BPR_kwDOG_uO484Bf4-u]
github_actions_secret.go_base_terraform_cloud_api_key: Refreshing state... [id=go-base:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.go_base: Refreshing state... [id=BPR_kwDOG6o6fs4BdUt4]
github_branch_protection.jinventory: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3NDU0ODk=]
github_actions_secret.terraform_cloud_api_key: Refreshing state... [id=terraform-github:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.terraform_github: Refreshing state... [id=BPR_kwDOFtzSP84BciXm]
github_actions_secret.aws_access_key_id: Refreshing state... [id=aws-nuke:AWS_ACCESS_KEY_ID]
github_actions_secret.aws_secret_access_key: Refreshing state... [id=aws-nuke:AWS_SECRET_ACCESS_KEY]
github_branch_protection.crawl: Refreshing state... [id=BPR_kwDOG9mVlc4BdzBc]
github_repository.exercism_kotlin: Drift detected (update)
github_repository.jlox: Drift detected (update)
github_repository.monkey: Drift detected (update)
github_repository.nasa: Drift detected (update)
github_repository.jinventory: Drift detected (update)
github_repository.exercism_x86_64_assembly: Drift detected (update)
github_repository.dotfiles: Drift detected (update)
github_repository.advent_of_code_2020: Drift detected (update)
github_repository.spring_microservices_in_action: Drift detected (update)
github_repository.experiment_kafka: Drift detected (update)
github_repository.www_chriswilding_dev: Drift detected (update)
github_repository.merchants_guide_to_the_galaxy: Drift detected (update)
github_repository.terraform_aws: Drift detected (update)
github_repository.ginventory: Drift detected (update)
github_repository.tiger_ocaml: Drift detected (update)
github_repository.go_base: Drift detected (update)
github_repository.nand2tetris: Drift detected (update)
github_repository.bill: Drift detected (update)
github_repository.terraform_github: Drift detected (update)
github_repository.tiger_go: Drift detected (update)
github_repository.exercism_java: Drift detected (update)
github_repository.to_roman_numeral: Drift detected (update)
github_repository.advent_of_code_2019: Drift detected (update)
github_repository.crawl: Drift detected (update)
github_repository.exercism_erlang: Drift detected (update)
github_repository.aws_nuke: Drift detected (update)
github_repository.curriculum_vitae: Drift detected (update)
github_repository.magidash: Drift detected (update)
github_repository.exercism_c: Drift detected (update)
github_repository.experiment_aurora_lambda: Drift detected (update)
github_repository.pact_broker: Drift detected (update)
github_repository.sahi: Drift detected (update)
github_repository.exercism_mips: Drift detected (update)
github_repository.exercism_rust: Drift detected (update)
github_repository.advent_of_code_2017: Drift detected (update)
github_repository.exercism_scala: Drift detected (update)
github_repository.organisation_accounts_client: Drift detected (update)
github_repository.advent_of_code_2018: Drift detected (update)
github_repository.exercism_go: Drift detected (update)
github_repository.powerful_command_line_applications_in_go: Drift detected (update)
github_repository.exercism_typescript: Drift detected (update)
github_repository.hotels: Drift detected (update)
github_repository.fsa: Drift detected (update)
github_repository.mazes_for_programmers: Drift detected (update)
github_repository.canvas: Drift detected (update)
github_repository.exercism_elixir: Drift detected (update)
github_repository.exercism_ocaml: Drift detected (update)
github_repository.pact_broker_secrets: Drift detected (update)
github_repository.bump: Drift detected (update)
github_repository.discography_api: Drift detected (update)
github_repository.terraform_aws_secrets: Drift detected (update)
github_repository.experiment_io_ts: Drift detected (update)
github_repository.advent_of_code_2021: Drift detected (update)
github_repository.clox: Drift detected (update)
github_repository.proglog: Drift detected (update)
github_repository.bookshelf_api: Drift detected (update)
github_repository.experiment_autotag: Drift detected (update)
github_repository.programming_rust: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_repository.advent_of_code_2017 will be updated in-place
  ~ resource "github_repository" "advent_of_code_2017" {
        id                          = "advent-of-code-2017"
        name                        = "advent-of-code-2017"
      ~ vulnerability_alerts        = false -> true
        # (35 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2018 will be updated in-place
  ~ resource "github_repository" "advent_of_code_2018" {
        id                          = "advent-of-code-2018"
        name                        = "advent-of-code-2018"
      ~ vulnerability_alerts        = false -> true
        # (35 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2019 will be updated in-place
  ~ resource "github_repository" "advent_of_code_2019" {
        id                          = "advent-of-code-2019"
        name                        = "advent-of-code-2019"
      ~ vulnerability_alerts        = false -> true
        # (35 unchanged attributes hidden)
    }

  # github_repository.advent_of_code_2020 will be updated in-place
  ~ resource "github_repository" "advent_of_code_2020" {
        id                          = "advent-of-code-2020"
        name                        = "advent-of-code-2020"
      ~ vulnerability_alerts        = false -> true
        # (35 unchanged attributes hidden)
    }

  # github_repository.bill will be updated in-place
  ~ resource "github_repository" "bill" {
        id                          = "bill"
        name                        = "bill"
      ~ vulnerability_alerts        = false -> true
        # (33 unchanged attributes hidden)
    }

  # github_repository.canvas will be updated in-place
  ~ resource "github_repository" "canvas" {
        id                          = "canvas"
        name                        = "canvas"
      ~ vulnerability_alerts        = false -> true
        # (32 unchanged attributes hidden)
    }

  # github_repository.fsa will be updated in-place
  ~ resource "github_repository" "fsa" {
        id                          = "fsa"
        name                        = "fsa"
      ~ vulnerability_alerts        = false -> true
        # (33 unchanged attributes hidden)
    }

  # github_repository.hotels will be updated in-place
  ~ resource "github_repository" "hotels" {
        id                          = "hotels"
        name                        = "hotels"
      ~ vulnerability_alerts        = false -> true
        # (33 unchanged attributes hidden)
    }

  # github_repository.merchants_guide_to_the_galaxy will be updated in-place
  ~ resource "github_repository" "merchants_guide_to_the_galaxy" {
        id                          = "merchants-guide-to-the-galaxy"
        name                        = "merchants-guide-to-the-galaxy"
      ~ vulnerability_alerts        = false -> true
        # (34 unchanged attributes hidden)
    }

  # github_repository.nasa will be updated in-place
  ~ resource "github_repository" "nasa" {
        id                          = "nasa"
        name                        = "nasa"
      ~ vulnerability_alerts        = false -> true
        # (35 unchanged attributes hidden)
    }

  # github_repository.sahi will be updated in-place
  ~ resource "github_repository" "sahi" {
        id                          = "sahi"
        name                        = "sahi"
      ~ vulnerability_alerts        = false -> true
        # (33 unchanged attributes hidden)
    }

  # github_repository.tiger will be created
  + resource "github_repository" "tiger" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "Go"
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "tiger"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
    }

  # github_repository.tiger_go will be destroyed
  # (because github_repository.tiger_go is not in configuration)
  - resource "github_repository" "tiger_go" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"ea3dbb58009d928ae5a2ab8b456db5868b4a8d654e69aed3917f5ecce76162e1\"" -> null
      - full_name                   = "chriswilding/tiger-go" -> null
      - git_clone_url               = "git://github.com/chriswilding/tiger-go.git" -> null
      - gitignore_template          = "Go" -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/chriswilding/tiger-go" -> null
      - http_clone_url              = "https://github.com/chriswilding/tiger-go.git" -> null
      - id                          = "tiger-go" -> null
      - is_template                 = false -> null
      - license_template            = "apache-2.0" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "tiger-go" -> null
      - node_id                     = "R_kgDOHJf2DQ" -> null
      - private                     = false -> null
      - repo_id                     = 479720973 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:chriswilding/tiger-go.git" -> null
      - svn_url                     = "https://github.com/chriswilding/tiger-go" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
    }

  # github_repository.tiger_ocaml will be destroyed
  # (because github_repository.tiger_ocaml is not in configuration)
  - resource "github_repository" "tiger_ocaml" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"a22d0cc58dbb119b481b7a1b421034993623aff7a7fc85860e6a6223b148aac3\"" -> null
      - full_name                   = "chriswilding/tiger-ocaml" -> null
      - git_clone_url               = "git://github.com/chriswilding/tiger-ocaml.git" -> null
      - gitignore_template          = "OCaml" -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/chriswilding/tiger-ocaml" -> null
      - http_clone_url              = "https://github.com/chriswilding/tiger-ocaml.git" -> null
      - id                          = "tiger-ocaml" -> null
      - is_template                 = false -> null
      - license_template            = "apache-2.0" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "tiger-ocaml" -> null
      - node_id                     = "R_kgDOHJf2Gg" -> null
      - private                     = false -> null
      - repo_id                     = 479720986 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:chriswilding/tiger-ocaml.git" -> null
      - svn_url                     = "https://github.com/chriswilding/tiger-ocaml" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
    }

  # github_repository.to_roman_numeral will be updated in-place
  ~ resource "github_repository" "to_roman_numeral" {
        id                          = "to-roman-numeral"
        name                        = "to-roman-numeral"
      ~ vulnerability_alerts        = false -> true
        # (33 unchanged attributes hidden)
    }

Plan: 1 to add, 12 to change, 2 to destroy.

```

</details>

*Pusher: @chriswilding, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*